Revit 2027 API
ConceptualConstructionType.GetFloorOrSlabConstructionType Method
 Get a Floor or Slab ConceptualConstructionType by its ConceptualConstructionFloorSlabType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetFloorOrSlabConstructionType(
	Document ccda,
	ConceptualConstructionFloorSlabType typeEnum
)
Public Shared Function GetFloorOrSlabConstructionType (
	ccda As Document,
	typeEnum As ConceptualConstructionFloorSlabType
) As ElementId
public:
static ElementId^ GetFloorOrSlabConstructionType(
	Document^ ccda,
	ConceptualConstructionFloorSlabType typeEnum
)
static member GetFloorOrSlabConstructionType :
        ccda : Document *
        typeEnum : ConceptualConstructionFloorSlabType -> ElementId
Parameters
ccda Document
 The Document.
typeEnum ConceptualConstructionFloorSlabType
 The ConceptualConstructionFloorSlabType to get the ConceptualConstructionType for.
Return Value
ElementId
 Returns ElementId of a ConceptualConstructionType.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The enum is invalid for ConceptualConstructionFloorSlabType. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace